h2s0109/smart/Mcal_file/TC23x_ABstep/Aurix_MC-ISAR/fr_17_eray_infineon_tricore/demo/src/Fr_17_Eray_Demo.c
/*******************************************************************************
**                                                                            **
** Copyright (C) Infineon Technologies (2013)                                 **
**                                                                            **
** All rights reserved.                                                       **
**                                                                            **
** This document contains proprietary information belonging to Infineon       **
** Technologies. Passing on and copying of this document, and communication   **
** of its contents is not permitted without prior written authorization.      **
**                                                                            **
*******************************************************************************
**                                                                           **
**  $FILENAME   : Fr_17_Eray_Demo.c $                                        **
**                                                                           **
**  $CC VERSION : \main\30 $                                                 **
**                                                                           **
**  $DATE       : 2015-11-02 $                                               **
**                                                                           **
**  AUTHOR      : DL-AUTOSAR-Engineering                                     **
**                                                                           **
**  VENDOR      : Infineon Technologies                                      **
**                                                                           **
**  DESCRIPTION : This file contains function prototypes for demo            **
**                   application for FlexRay driver                          **
**                                                                           **
**  MAY BE CHANGED BY USER [yes/no]: yes                                     **
**                                                                           **
******************************************************************************/

/*******************************************************************************
**                      Includes                                              **
*******************************************************************************/
#include "Std_Types.h"
#include "IfxEray_reg.h"
#include "IfxSrc_reg.h"
#include "IfxScu_reg.h"
#include "IfxCpu_reg.h"
#include "Mcal.h"
#include "Fr_17_Eray_Demo.h"
#include "Fr_17_Eray.h"
#include "Port.h"
#include "EcuM.h"
#include "Test_Print.h"
#include "Test_Time.h"
#include "Test_Main.h"

/*******************************************************************************
**                      Imported Compiler Switch Check                        **
*******************************************************************************/


/*******************************************************************************
**                      Private Macro Definitions                             **
*******************************************************************************/
/* Number of times different data is transmitted using an LPDU */
#define FR_17_ERAY_DATA_COUNT       (2U)

/* Data modification factor for next tranmission by an LPDU */
#define FR_17_ERAY_DATA_INCREMENT   (1U)

/* Initial data pattern used by first transmission by node 0 */
#define FR_17_ERAY_INITIAL_DATA     (0x10U)

#define FR_17_ERAY_POCS_NORMAL_ACTIVE   ((uint8)0x02)

#define FR_17_ERAY_POCS_NORMAL_PASSIVE  ((uint8)0x03)

#define FR_BEGIN_LPDU_RECONFIGURATION  ((uint8)18)
#define FR_BEGIN_LPDU_DISABLING_CANCELLATION  ((uint8)19)

#define FR_17_ERAY_LPDU7_INDX        ((uint8)0x07)

#define FR_NON_RECONFIG_LPDU_COUNT   ((uint8)0x04)

#define FR_TX_LPDU_HEADER_CRC_VAL    ((uint16)1750)

#define FR_RECONFIGURED_FRAME_ID     ((uint8)6)

#define FR_TX_CYCLE_REP_COUNT  ((uint8)4)
#define FR_TX_BASE_CYCLE       ((uint8)2)
                               
#define FR_RX_CYCLE_REP_COUNT  ((uint8)8)
#define FR_RX_BASE_CYCLE       ((uint8)4)

#define FR_SAFETY_ENDINT_TIMEOUT ((uint32)150000U)

/* Macro to check if communication controller is synchronised to global time */
#define Fr_17_Eray_DemoIsCcInSync()    \
      ( (ERAY0_CCSV.B.POCS == FR_17_ERAY_POCS_NORMAL_ACTIVE) || \
        (ERAY0_CCSV.B.POCS == FR_17_ERAY_POCS_NORMAL_PASSIVE) )

#define CPU_PSW_USER_MODE_MASK (0xFFFFF3FFU)
#define SET_USER_MODE_MASK ((1U  <<  10U))

/*******************************************************************************
**                      Private Type Definitions                              **
*******************************************************************************/

/*******************************************************************************
**                      Private Function Declarations                         **
*******************************************************************************/

/*******************************************************************************
**                      Global Constant Definitions                           **
*******************************************************************************/

/*******************************************************************************
**                      Global Variable Definitions                           **
*******************************************************************************/
#define FR_17_ERAY_START_SEC_VAR_32BIT
#include "MemMap.h"

/* Transmit buffer : Used by node 0 to transmit */
static uint8 FrDemo_TxDataBuffer[254] ;

/* 
  Recieve buffer  : Used by node 0 to temporarily store data received 
  from node 1  
*/
static uint8 FrDemo_RxDataBuffer[254] ; 

/* 
  Storage for data multiple receptions. Needed for validation of received data 
*/
static uint8 FrDemo_RxData[FR_17_ERAY_DATA_COUNT][254];
/* 
  Storage for NM vector w.r.t multiple receptions. Needed for validation of 
  received data 
*/
static uint32 FrDemo_NmVectorPtr[FR_17_ERAY_DATA_COUNT];

#define FR_17_ERAY_STOP_SEC_VAR_32BIT
#include "MemMap.h"

void FrDemo_PrepareTxData(uint8 *SrcPtr, uint8 *DstPtr, uint8 DataLength);
void FrDemo_CopyReceivedData(uint8 *SrcPtr, uint8 *DstPtr, uint8 DataLength);
uint32 FrDemo_VerifyData(uint8 *DataPtr, uint8 DataLength, 
                          uint16 RxDataIndex, uint8 InitialData);
void FrDemo_InitializeBuffer(uint8 *BufferPtr, uint8 DataLength, uint8 Data);
void FrDemo_PrintData(uint8 *BufferPtr, uint8 DataLength);
void FrDemo_PrintArray(uint16 *BufferPtr, uint8 DataLength);

