h2s0109/smart/Mcal_file/TC23x_ABstep/Aurix_MC-ISAR/fr_17_eray_infineon_tricore/demo/src/Fr_17_Eray_Demo.c
/*******************************************************************************
**                      Private Constant Definitions                          **
*******************************************************************************/


/*******************************************************************************
**                      Private Variable Definitions                          **
*******************************************************************************/
/*******************************************************************************
**                      Private Function Declarations                         **
*******************************************************************************/
uint32 FrDemo_ClusterStartup(void);
uint32 FrDemo_TxRxTest(uint16 TxLPduIdx, uint8 TxLSduLength, 
                                   uint16 RxLPduIdx, uint8 InitialData );
uint32 FrDemo_ReconfigLpduTest(uint16 TxLPduIdx,uint8 TxLSduLength,
  uint16 RxLPduIdx,uint8 InitialData);
uint32 FrDemo_TimerTest(void);
void IrqEray_Init(void);

/*******************************************************************************
**                      Private Function Definitions                          **
*******************************************************************************/
/*******************************************************************************
** Syntax : void Fr_17_Eray_Demo(void)                                               **
**                                                                            **
** Service ID:   : NA                                                         **
**                                                                            **
** Sync/Async:   : Synchronous                                                **
**                                                                            **
** Reentrancy:   : Non Reentrant                                              **
**                                                                            **
** Parameters (in): none                                                      **
**                                                                            **
** Parameters (out): none                                                     **
**                                                                            **
** Return value: none                                                         **
**                                                                            **
** Description : Performs the start-up procedure to estimate the estimate     **
**                 the transmission delays and programs them into the MLI     **
**                 local transmitter and MLI remote receiver                  **
**              Writes data to the MLI remote receiver                        **
**              Reads data from MLI remote receiver                           **
*******************************************************************************/

void Fr_17_Eray_Demo(void)
{
 
  
/*  Std_VersionInfoType versionInfo ; */
  
#ifdef FR_17_ERAY_PBCFG_0
  uint8 i ;
  uint8 LPduIndex ;
  uint8 LPduCountNode1 ;  
  uint8 PlcBytes ;
  uint8 CycleNumber1, CycleNumber2 ;
  uint8 RetValue;
  uint8 FrDemo_ConfigParamIdx;
  uint8 FrDemo_NumOfStartupFrames;  
  uint16 MacroTickPtr ;
  uint16 FrDemo_ChannelAStatus, FrDemo_ChannelBStatus;
  uint16 FrDemo_ChannelAEvenList[10],FrDemo_ChannelBEvenList[10];    
  uint16 FrDemo_ChannelAOddList[10],FrDemo_ChannelBOddList[10];
  sint16 FrDemo_RateCorrection;
  sint32 FrDemo_OffsetCorrection;
  uint32 FrDemo_ConfigParamValue;
  uint32 ErrorCount = 0 ;
#endif  
#ifdef IFX_MCAL_RUN_MODE_DEFINE
/* IFX_MCAL_RUN_MODE_DEFINE = 0 indicates MCAL,
  runs in Supervisor mode*/
#if(IFX_MCAL_RUN_MODE_DEFINE != 0U)
/* Set the user-1 mode on*/
uint32 Cpu_PSW;
#endif 
#endif

  print_f("\n--------------- Start of FlexRay driver demo ---------------\n");

/* #if (FR_17_ERAY_VERSION_INFO_API == ON)
  Fr_17_Eray_GetVersionInfo(&versionInfo);
  print_f("Vendor ID : %d\n", versionInfo.vendorID); 
  print_f("Module ID : %d\n", versionInfo.moduleID); 
  print_f("Instance ID : %d\n", versionInfo.instanceID); 
  print_f("FR Driver version : ");
  print_f("%d.", versionInfo.sw_major_version); 
  print_f("%d.", versionInfo.sw_minor_version); 
  print_f("%d\n", versionInfo.sw_patch_version); 
#endif  
*/

/*  UNUSED_PARAMETER(ErrorCount)*/

#ifdef FR_17_ERAY_PBCFG_0
  /* Initialize FlexRay driver for demo application (first part) */
  Fr_17_Eray_Init(&Fr_17_Eray_ConfigRoot[0]);
  
  /* Call this function if interrupt support is required */
  /* IrqEray_Init(); */
#endif

#ifdef FR_17_ERAY_PBCFG_1
  /* Initialize FlexRay driver for demo application (second part) */
  Fr_17_Eray_Init(&Fr_17_Eray_ConfigRoot[1]);
#endif

/*Clock Out*/
Mcal_ResetSafetyENDINIT_Timed(FR_SAFETY_ENDINT_TIMEOUT);
   SCU_EXTCON.B.SEL0 = 2;
   SCU_EXTCON.B.EN0 = 1; 
Mcal_SetSafetyENDINIT_Timed();

#ifdef IFX_MCAL_RUN_MODE_DEFINE
  /* IFX_MCAL_RUN_MODE_DEFINE = 0 indicates MCAL,
     runs in Supervisor mode*/
#if(IFX_MCAL_RUN_MODE_DEFINE != 0U)
  /* Set the user-1 mode on*/
  Cpu_PSW = (uint32)MFCR(CPU_PSW);
  Cpu_PSW = (Cpu_PSW & CPU_PSW_USER_MODE_MASK);
  Cpu_PSW = (Cpu_PSW | SET_USER_MODE_MASK);
  MTCR (CPU_PSW, Cpu_PSW); /* Set mode to user-1 mode. */
#endif
#endif      
/*----------------------------------------------------------------------------*/
#ifdef FR_17_ERAY_PBCFG_0
  print_f("\nThis is FlexRay Communication Controller 0 \n\n");
  print_f("\nCurrently Communication Controller is in Key slot only Transmission Mode \n\n");

   /* Set FR_CIDX_PKEYSLOTONLYENABLED as Config Param Idx*/
   FrDemo_ConfigParamIdx = FR_CIDX_PKEYSLOTONLYENABLED;
   
	Fr_17_Eray_ReadCCConfig( 0, FrDemo_ConfigParamIdx, &FrDemo_ConfigParamValue );
	print_f("Configured Value of FrPKeySlotOnlyEnabled is %d \n",FrDemo_ConfigParamValue);

  ErrorCount += FrDemo_ClusterStartup();

  if(ErrorCount == 0)
  {	
	  RetValue = Fr_17_Eray_AllSlots(0);
	  if(RetValue == E_OK)
	  {
		  print_f("\nSwitching from Key slot only mode to All Slots Transmission Mode \n\n");
	  }
	  else
	  {
		  print_f("\nFAILED to Switch to All Slots Transmission Mode \n");
		  print_f("\nCC is NOT synchronized to global time\n\n");
	  }
  }
  else
  {
    return;
  }
  	
  Fr_17_Eray_GetGlobalTime(0, &CycleNumber1, &MacroTickPtr);

  CycleNumber2 = CycleNumber1 + 1 ;

  do
  {
    Fr_17_Eray_GetGlobalTime(0, &CycleNumber1, &MacroTickPtr);
  } while (CycleNumber1 != CycleNumber2) ;

	Fr_17_Eray_GetNumOfStartupFrames(0, &FrDemo_NumOfStartupFrames);
	print_f("No. of Startup Frames Received is %d \n",FrDemo_NumOfStartupFrames);
 
	Fr_17_Eray_GetSyncFrameList(0, 10, FrDemo_ChannelAEvenList, FrDemo_ChannelBEvenList, \
	                            FrDemo_ChannelAOddList, FrDemo_ChannelBOddList );
	
	print_f("\nSync Frame Ids Received on Channel A Even Cycles = \n");
	FrDemo_PrintArray(FrDemo_ChannelAEvenList,10);
	print_f("\nSync Frame Ids Received on Channel B Even Cycles = \n");
	FrDemo_PrintArray(FrDemo_ChannelBEvenList,10);
	print_f("\nSync Frame Ids Received on Channel A Odd Cycles = \n");
	FrDemo_PrintArray(FrDemo_ChannelAOddList,10);
	print_f("\nSync Frame Ids Received on Channel B Odd Cycles = \n");
	FrDemo_PrintArray(FrDemo_ChannelBOddList,10);

	Fr_17_Eray_GetClockCorrection(0, &FrDemo_RateCorrection, &FrDemo_OffsetCorrection );
	print_f("\n\nRateCorrection Value for CC = %d \n",FrDemo_RateCorrection);
	print_f("OffsetCorrection Value for CC = %d \n",FrDemo_OffsetCorrection);
	
   print_f("\n-------------------------------------------------------------- \n") ;
  
  LPduCountNode1 = FR_NON_RECONFIG_LPDU_COUNT ;

  for (LPduIndex = 0; 
               (LPduIndex < LPduCountNode1) && ((ErrorCount == 0)) ; 
                                                    LPduIndex = LPduIndex + 2)
  {
    PlcBytes = Fr_17_Eray_ConfigRoot[0].CfgPtr[0].LPduConfigPtr[LPduIndex].WRHS2.B.PayloadLengthConfigured * 2 ;
    
    print_f("***** Communication with LPDU %d and %d ***** \n", LPduIndex, (LPduIndex + 1)) ;
    
