h2s0109/smart/Mcal_file/TC23x_ABstep/Aurix_MC-ISAR/fr_17_eray_infineon_tricore/demo/src/Fr_17_Eray_Demo.c
    /* 
      Note: NMVector is assumed to be 2. Even if more than 2 bytes are used, 
            only first 2 are used for NM vector verification 
    */
    for (i = 1 ; ((i < 5) && (PlcBytes > 1) && (ErrorCount == 0)) ; i++ )
    {
      print_f("[ Length = %d ]\n", PlcBytes) ;
      ErrorCount += FrDemo_TxRxTest(LPduIndex, PlcBytes--, (LPduIndex + 1), (FR_17_ERAY_INITIAL_DATA + LPduIndex + i) );
    }
    print_f("\n-------------------------------------------------------------- \n") ;
  }

    print_f("***** Communication using Reconfigured LPDU 4 and 5 ***** \n") ;
    ErrorCount += FrDemo_ReconfigLpduTest(4,2,5,FR_17_ERAY_INITIAL_DATA);
    
    Fr_17_Eray_GetChannelStatus(0, &FrDemo_ChannelAStatus, &FrDemo_ChannelBStatus );
		print_f("\nLegend for Channel Status \n");
		print_f("--------------------------------- \n");
		print_f("1 - Valid Frame Received on the Channel\n");
		print_f("ANY OTHER VALUE - Slot Status Error Occurred\n");
		print_f("--------------------------------- \n");
		print_f("\nChannel A Status Value is %d \n",FrDemo_ChannelAStatus);
		print_f("Channel B Status Value is %d \n",FrDemo_ChannelBStatus);

#endif    
/*----------------------------------------------------------------------------*/
#ifdef FR_17_ERAY_PBCFG_1  
  print_f("\nThis is FlexRay Communication Controller 1 \n");
  while(1)
  {
    uint8  LSduLength = 0;
    uint8  RxFrameCount = 0U;
    uint16 RxLPduIdx,j ;
 /*   uint32 ErrorCount = 0 ;*/
    uint32 ClusterStartupStatus = 1;
    
    Fr_TxLPduStatusType TxLPduStatus ;
    Fr_RxLPduStatusType RxLPduStatus ;
    
    Std_ReturnType RetValue ;
    
 /*   UNUSED_PARAMETER(ErrorCount)*/
    do
    {
      print_f("Trying FlexRay cluster startup...");
      ClusterStartupStatus = FrDemo_ClusterStartup();
    }while (ClusterStartupStatus == 1);
    
    /* Wait as long as other FlexRay node remains synchronised to this node */
    do
    {
      /* Make sure fresh data is received */
      FrDemo_InitializeBuffer(FrDemo_RxDataBuffer, 254, 0xDE);
  
      RxLPduIdx = 1 ;
      
      do
      {  
        /* Prepare receive LPdu */
        Fr_17_Eray_PrepareLPdu(0, RxLPduIdx );
        
        /* Prepare transmit LPdu */
        Fr_17_Eray_PrepareLPdu(0, (RxLPduIdx - 1)); 
      
        RetValue = Fr_17_Eray_ReceiveRxLPdu( 0, RxLPduIdx , 
                                     (uint8*) &FrDemo_RxDataBuffer, 
                                     &RxLPduStatus, &LSduLength );
        
        if(RetValue != E_OK)
        {
          print_f("The Fr_17_Eray_ReceiveRxLPdu returned E_NOT_OK. Halting the CC\n");
          Fr_17_Eray_AbortCommunication(0) ;
          break ;
        }
                                                      
        if(RxLPduStatus == FR_RECEIVED)
        {
          
          print_f("\nData received: ");
          RxFrameCount++;
          FrDemo_PrintData(FrDemo_RxDataBuffer, LSduLength);
          
          FrDemo_PrepareTxData( FrDemo_RxDataBuffer, FrDemo_TxDataBuffer, LSduLength);
          
          print_f("\nData transmitted back: ");          
          FrDemo_PrintData(FrDemo_TxDataBuffer, LSduLength);
          
          Fr_17_Eray_TransmitTxLPdu(0, (uint8)(RxLPduIdx - 1), (uint8*) &FrDemo_TxDataBuffer, 
                                                              LSduLength) ;              
          do
          {
            Fr_17_Eray_CheckTxLPduStatus(0, (uint8)(RxLPduIdx - 1), &TxLPduStatus);
          }while (TxLPduStatus != FR_TRANSMITTED);    
        }
        
        RxLPduIdx+= 2 ;
        
      }while (RxLPduIdx < (FR_NON_RECONFIG_LPDU_COUNT)) ;      

      if(RxFrameCount == FR_BEGIN_LPDU_RECONFIGURATION)
      {
	        RxLPduIdx = FR_17_ERAY_LPDU7_INDX ;
	        
	        /* Prepare receive LPdu */
	        Fr_17_Eray_PrepareLPdu(0, RxLPduIdx );
	        
	        /* Prepare transmit LPdu */
	        Fr_17_Eray_PrepareLPdu(0, (RxLPduIdx - 1)); 
	      
		      do
		      {
		        RetValue = Fr_17_Eray_ReceiveRxLPdu( 0, RxLPduIdx , 
		                                     (uint8*) &FrDemo_RxDataBuffer, 
		                                     &RxLPduStatus, &LSduLength );
		        
		        if(RetValue != E_OK)
		        {
		          print_f("The Fr_17_Eray_ReceiveRxLPdu returned E_NOT_OK. Halting the CC\n");
		          Fr_17_Eray_AbortCommunication(0) ;
		          break ;
		        }
		       }while(RxLPduStatus != FR_RECEIVED);
	                                                            
	        if(RxLPduStatus == FR_RECEIVED)
	        {
            RxFrameCount++;
	          print_f("\n Length of Data received is %d",LSduLength);
	          print_f("\nData received: ");
	          FrDemo_PrintData(FrDemo_RxDataBuffer, LSduLength);
	          
	          FrDemo_PrepareTxData( FrDemo_RxDataBuffer, FrDemo_TxDataBuffer, LSduLength);
	          
	          print_f("\n Length of Data Transmitted is %d",LSduLength);
	          print_f("\nData transmitted back: ");          
	          FrDemo_PrintData(FrDemo_TxDataBuffer, LSduLength);
	          
	          Fr_17_Eray_TransmitTxLPdu(0, (uint8)(RxLPduIdx - 1), (uint8*) &FrDemo_TxDataBuffer, 
	                                                              LSduLength) ;              
	          do
	          {
	            Fr_17_Eray_CheckTxLPduStatus(0, (uint8)(RxLPduIdx - 1), &TxLPduStatus);
	          }while (TxLPduStatus != FR_TRANSMITTED);    
	        }
      }
            
      if(RxFrameCount == FR_BEGIN_LPDU_DISABLING_CANCELLATION)
      {
            RxFrameCount++;
		      do
		      {
		        RetValue = Fr_17_Eray_ReceiveRxLPdu( 0, RxLPduIdx , 
		                                     (uint8*) &FrDemo_RxDataBuffer, 
		                                     &RxLPduStatus, &LSduLength );
		        
		        if(RetValue != E_OK)
		        {
		          print_f("The Fr_17_Eray_ReceiveRxLPdu returned E_NOT_OK. Halting the CC\n");
		          Fr_17_Eray_AbortCommunication(0) ;
		          break ;
		        }
		       }while(RxLPduStatus != FR_RECEIVED);

	        if(RxLPduStatus == FR_RECEIVED)
	        {
	          print_f("\n Length of Data received is %d",LSduLength);
	          print_f("\nData received: ");
	          FrDemo_PrintData(FrDemo_RxDataBuffer, LSduLength);
	        }

