h2s0109/smart/Mcal_file/TC23x_ABstep/Aurix_MC-ISAR/fr_17_eray_infineon_tricore/demo/src/Fr_17_Eray_Demo.c
	        j = 0;
		      do
		      {
		        RetValue = Fr_17_Eray_ReceiveRxLPdu( 0, RxLPduIdx , 
		                                     (uint8*) &FrDemo_RxDataBuffer, 
		                                     &RxLPduStatus, &LSduLength );
		        j++;
		        if(RetValue != E_OK)
		        {
		          print_f("The Fr_17_Eray_ReceiveRxLPdu returned E_NOT_OK. Halting the CC\n");
		          Fr_17_Eray_AbortCommunication(0) ;
		          break ;
		        }
		      }while((RxLPduStatus != FR_RECEIVED) && (j != 255));
	                                                            
	        if(LSduLength == 0)
	        {
	          print_f("\n\nNO DATA Received.CANCELLATION of TxLpdu was Successfull\n");
	        }

          print_f("\n Length of Data received is %d",LSduLength);
          print_f("\nData received: ");
          FrDemo_PrintData(FrDemo_RxDataBuffer, LSduLength);
          
          FrDemo_PrepareTxData( FrDemo_RxDataBuffer, FrDemo_TxDataBuffer, LSduLength);
	          
	        j = 0;
		      do
		      {
		        RetValue = Fr_17_Eray_ReceiveRxLPdu( 0, RxLPduIdx , 
		                                     (uint8*) &FrDemo_RxDataBuffer, 
		                                     &RxLPduStatus, &LSduLength );
		        j++;
		        if(RetValue != E_OK)
		        {
		          print_f("The Fr_17_Eray_ReceiveRxLPdu returned E_NOT_OK. Halting the CC\n");
		          Fr_17_Eray_AbortCommunication(0) ;
		          break ;
		        }
		       }while((RxLPduStatus != FR_RECEIVED) && (j != 255));
	                                                            
		        if(LSduLength == 0)
		        {
		          print_f("\n\nNO DATA Received.DISABLING of TxLpdu was Successfull\n");
		        }

	          print_f("\n Length of Data received is %d",LSduLength);
	          print_f("\nData received: ");
	          FrDemo_PrintData(FrDemo_RxDataBuffer, LSduLength);
	          
	          FrDemo_PrepareTxData( FrDemo_RxDataBuffer, FrDemo_TxDataBuffer, LSduLength);

	          LSduLength = 2;
	          print_f("\n\n Length of Data Transmitted is %d",LSduLength);
	          print_f("\nData transmitted back: ");          
	          FrDemo_PrintData(FrDemo_TxDataBuffer, LSduLength);
	          
	          Fr_17_Eray_TransmitTxLPdu(0, (uint8)(RxLPduIdx - 1), (uint8*) &FrDemo_TxDataBuffer, 
	                                                              LSduLength) ;              
	          do
	          {
	            Fr_17_Eray_CheckTxLPduStatus(0, (uint8)(RxLPduIdx - 1), &TxLPduStatus);
	          }while (TxLPduStatus != FR_TRANSMITTED);    
	      }
    }while(Fr_17_Eray_DemoIsCcInSync());
  }
#endif    
/*----------------------------------------------------------------------------*/
#ifdef FR_17_ERAY_PBCFG_0
  if(ErrorCount == 0)
  {  
    Fr_POCStatusType Fr_17_Eray_POCStatus ; 
  
    ErrorCount += FrDemo_TimerTest();
  
    Fr_17_Eray_AbortCommunication(0) ;
    
    Fr_17_Eray_GetPOCStatus(0, &Fr_17_Eray_POCStatus);
        
    if(Fr_17_Eray_POCStatus.State != FR_POCSTATE_HALT)
    {
      print_f("FlexRay CC did not abort the communication\n");
      ErrorCount++ ;
    }
  }
  if(ErrorCount)
  {
    print_f("FlexRay demo FAILED.\n");
  }
  else
  {
    print_f("FlexRay demo PASSED.\n");
  }
  print_f("-------------------------------------------------------------- \n") ;
#endif    

}

uint32 FrDemo_ClusterStartup(void)
{
  volatile uint32 i ;
  Std_ReturnType ApiReturnValue ;  

  Fr_POCStatusType POCStatusNew ; 
  Fr_POCStatusType POCStatusOld ;

#ifdef FR_17_ERAY_PBCFG_0
  uint8 FrTest_WakeupRxStatus=0;
#endif
  
#ifdef FR_17_ERAY_PBCFG_1
  uint8 FrDemo_ConfigParamIdx;
  uint32 FrDemo_ConfigParamValue;
#endif

  /* Initialize FlexRay CC */
  Fr_17_Eray_ControllerInit(0);
 
#ifdef FR_17_ERAY_PBCFG_0
	do
	{
	  Fr_17_Eray_GetWakeupRxStatus(0, &FrTest_WakeupRxStatus );

	}while(!FrTest_WakeupRxStatus);
	
	if(FrTest_WakeupRxStatus == 1)
	{
	  print_f("\nWakeup Pattern Received on FR_CHANNEL_A \n");
	}
	else if(FrTest_WakeupRxStatus == 2)
	{
	  print_f("\nWakeup Pattern Received on FR_CHANNEL_B \n");
	}

  Fr_17_Eray_GetPOCStatus(0, &POCStatusNew);
  
  while(POCStatusNew.State != FR_POCSTATE_READY)
  {
    Fr_17_Eray_GetPOCStatus(0, &POCStatusNew);
  }  
#endif
 
#ifdef FR_17_ERAY_PBCFG_1
		/* Set FR_CIDX_PWAKEUPCHANNEL as Config Param Idx*/
		FrDemo_ConfigParamIdx = FR_CIDX_PWAKEUPCHANNEL;
		
		Fr_17_Eray_ReadCCConfig( 0, FrDemo_ConfigParamIdx, &FrDemo_ConfigParamValue );
    if(FrDemo_ConfigParamValue == 0)
    {
  		print_f("\nDefault Configured FrPWakeupChannel is FR_CHANNEL_A \n");
    }
    else
    {
  		print_f("\nDefault Configured FrPWakeupChannel is FR_CHANNEL_B \n");
    }

    Fr_17_Eray_SetWakeupChannel(0,FR_CHANNEL_A);
    print_f("\nSetting FR Wakeup Channel as FR_CHANNEL_B \n");
    i = 255 ;

		do
		{
		  Fr_17_Eray_GetPOCStatus(0, &POCStatusNew);
      if(POCStatusNew.State != FR_POCSTATE_WAKEUP)
      {
      	Fr_17_Eray_SendWUP(0);   /* Send wakeup signal */
      }
      i--;
		}while((POCStatusNew.State != FR_POCSTATE_WAKEUP)&& i);

	  print_f("\nSent Wakeup Pattern on FR_CHANNEL_B \n");

  Fr_17_Eray_GetPOCStatus(0, &POCStatusNew);
  
  while(POCStatusNew.State != FR_POCSTATE_READY)
  {
    Fr_17_Eray_GetPOCStatus(0, &POCStatusNew);
  }  
#endif
 
  i = 10 ;  
  do
  {
    ApiReturnValue = Fr_17_Eray_AllowColdstart(0) ;
  } while ((ApiReturnValue == E_NOT_OK) && (i--));
  
  if(i == 0)
  {
    print_f("Fr_17_Eray_AllowColdstart API execution failed.\n");
  }
  
  /* Start FlexRay communication */
  i = 10 ;  
  do
  {
    ApiReturnValue = Fr_17_Eray_StartCommunication(0) ;
  } while ((ApiReturnValue == E_NOT_OK) && (i--));
  if(i == 0)
  {
    print_f("Fr_17_Eray_StartCommunication API execution failed.\n");
    return 1 ; /* failure */
  }  

  Fr_17_Eray_GetPOCStatus(0, &POCStatusOld);
  
  print_f("\nLegend for POC Startup State \n");
  print_f("--------------------------------- \n");
  print_f("0 - UNDEFINED\n");
  print_f("1 - COLDSTART_LISTEN\n");
  print_f("2 - INTEGRATION_COLDSTART_CHECK\n");
  print_f("3 - COLDSTART_JOIN\n");
  print_f("4 - COLLISION_RESOLUTION\n");
  print_f("5 - CONSISTENCY_CHECK\n");
  print_f("6 - INTEGRATION_LISTEN\n");
  print_f("7 - INITIALIZE_SCHEDULE\n");
  print_f("8 - INTEGRATION_CONSISTENCY_CHECK\n");
  print_f("9 - COLDSTART_GAP\n");
  print_f("\n");
                          
