h2s0109/smart/Mcal_file/TC23x_ABstep/Aurix_MC-ISAR/fr_17_eray_infineon_tricore/demo/src/Fr_17_Eray_Demo.c
  print_f("FlexRay cluster start up in progress.... \n\n"); 
  print_f("Startup state transitions = ");
  
  /* Wait till FlexRay CC synchronised to FlexRay global time */
  do
  {
    Fr_17_Eray_GetPOCStatus(0, &POCStatusNew);
    
    if (POCStatusNew.StartupState != POCStatusOld.StartupState)
    {
      print_f("%d, ", POCStatusNew.StartupState);
      POCStatusOld.StartupState = POCStatusNew.StartupState ;
    }
  }while( (!(Fr_17_Eray_DemoIsCcInSync())) && 
          (POCStatusNew.StartupState != FR_STARTUP_INTEGRATION_LISTEN) &&
          (POCStatusNew.State != FR_POCSTATE_HALT));
  
  if(Fr_17_Eray_DemoIsCcInSync())
  {
    print_f("\nFlexRay cluster startup successful. \n"); 
    return 0 ; /* Startup successful */
  }
  else
  {
    print_f("\n"); 
    if(POCStatusNew.State == FR_POCSTATE_HALT)
    {
      print_f("FlexRay CC moved to HALT state.\n");
      print_f("Try again. If it is persistent, check correctness of cluster parameters\n");
    }
    if(POCStatusNew.StartupState == FR_STARTUP_INTEGRATION_LISTEN)      
    {
      print_f("FlexRay cluster startup attempt failed. \n"); 
      print_f("Hints: Check if\n");
      print_f("- Other FlexRay node is ready for synchronisation.\n");
      print_f("- FlexRay nodes are connected properly.\n");      
      print_f("- Port pin configuration is done correctly.\n");      
      print_f("\n"); 
      print_f("================================================================="); 
      print_f("\n"); 
    }
    return 1 ; /* Startup failed */
  }
}

void FrDemo_InitializeBuffer( 
  uint8 * BufferPtr, 
  uint8 DataLength,
  uint8 Data
)
{
  uint32 i;
  
  for(i = 0; i < DataLength ; i++)
  {
    BufferPtr[i] = Data ;
  }
}

/* DataLength - in bytes as returned by API */
void FrDemo_CopyReceivedData( 
  uint8 * SrcPtr, 
  uint8 * DstPtr, 
  uint8 DataLength
)
{
  uint32 i;
  
  for(i = 0; i < DataLength ; i++)
  {
    DstPtr[i] = SrcPtr[i] ;
  }
}

void FrDemo_PrepareTxData( 
  uint8 * SrcPtr, 
  uint8 * DstPtr, 
  uint8 DataLength
)
{
  uint32 i;
  
  for(i = 0; i < DataLength ; i++)
  {
    DstPtr[i] = SrcPtr[i] + FR_17_ERAY_DATA_INCREMENT ;
  }
}

void FrDemo_PrintData( 
  uint8 * BufferPtr, 
  uint8 DataLength
)
{
  uint32 i;
  
  for(i = 0; i < DataLength ; i++)
  {
    print_f("%2x", BufferPtr[i]) ;
  }
}

void FrDemo_PrintArray( 
  uint16 * BufferPtr, 
  uint8 DataLength
)
{
  uint32 i;
  
  for(i = 0; i < DataLength ; i++)
  {
    print_f("%2x", BufferPtr[i]) ;
  }
}

uint32 FrDemo_VerifyData( 
  uint8 * DataPtr, 
  uint8 DataLength,
  uint16 RxDataIndex,
  uint8 InitialData
)
{
  uint32 i;
  uint32 ErrorCount = 0 ;
  
  for (i = 0; i < DataLength ; i++)
  {
    if( DataPtr[i] != (InitialData + (FR_17_ERAY_DATA_INCREMENT * (RxDataIndex + 1) * 2)) )
    {
      ErrorCount++ ;
    }
  }
  
  return ErrorCount ;
}

uint32 FrDemo_TxRxTest(
  uint16 TxLPduIdx, 
  uint8 TxLSduLength,
  uint16 RxLPduIdx,
  uint8 InitialData
)
{
  uint32 ErrorCount = 0 ;
  uint16 j;
  
  Fr_TxLPduStatusType TxLPduStatus ;
  
  Fr_RxLPduStatusType RxLPduStatus ;
  uint8 RxLSduLength ;
  
  Std_ReturnType RetValue ;
  uint32 NmVectorPtr;
  
  uint8 CycleNumber1, CycleNumber2 ;
  uint16 MacroTickPtr ;
  
/*----------------------------------------------------------------------------*/
/*            Normal data transmission and reception                          */
/*----------------------------------------------------------------------------*/
  print_f("Data transmission and reception in progress... \n"); 
  
  /* Initial data */
  FrDemo_InitializeBuffer(FrDemo_RxDataBuffer, TxLSduLength, InitialData);

  print_f("Initial data transferred: 0x%x\n", (InitialData + FR_17_ERAY_DATA_INCREMENT) );
    
  j = 0 ;
 
  do
  {  
    /* Create new data to be transferred */
    FrDemo_PrepareTxData(FrDemo_RxDataBuffer, FrDemo_TxDataBuffer, TxLSduLength);
    
    Fr_17_Eray_PrepareLPdu(0, (uint8)TxLPduIdx);
    Fr_17_Eray_PrepareLPdu(0, RxLPduIdx );    
    
    ERAY0_SIR.U = 0xC ;
    
    RetValue = Fr_17_Eray_TransmitTxLPdu(0, TxLPduIdx, (uint8*) &FrDemo_TxDataBuffer, 
                                                        TxLSduLength) ;
    if(RetValue == E_NOT_OK)
    {
      print_f("Fr_17_Eray_TransmitTxLPdu returned E_NOT_OK\n");
      ErrorCount++ ;
      return ErrorCount ;
    }
    
    do
    {
      RetValue = Fr_17_Eray_CheckTxLPduStatus(0, TxLPduIdx, &TxLPduStatus);
      
      if(RetValue == E_NOT_OK)
      {
        print_f("Fr_17_Eray_CheckTxLPduStatus returned E_NOT_OK\n");
        ErrorCount++ ;
        return ErrorCount ;
      }    
    }while (TxLPduStatus != FR_TRANSMITTED);    
    
    /* Make sure fresh data is received */
    FrDemo_InitializeBuffer(FrDemo_RxDataBuffer, TxLSduLength, 0xDE);
    
    do 
    {
      RetValue = Fr_17_Eray_ReceiveRxLPdu(0, RxLPduIdx, (uint8*) &FrDemo_RxDataBuffer, 
                                              &RxLPduStatus, &RxLSduLength);
                         
      if(RetValue == E_NOT_OK)
      {
        print_f("Fr_17_Eray_ReceiveRxLPdu returned E_NOT_OK\n");
        ErrorCount++ ;
        return ErrorCount ;
      }
    }while((RxLPduStatus != FR_RECEIVED) && (RxLPduStatus != FR_RECEIVED_MORE_DATA_AVAILABLE));
    
    Fr_17_Eray_GetGlobalTime(0, &CycleNumber1, &MacroTickPtr);
    CycleNumber2 = CycleNumber1 + 1 ;
    CycleNumber2 = CycleNumber2 % 64 ;

    do
    {
      Fr_17_Eray_GetGlobalTime(0, &CycleNumber1, &MacroTickPtr);
    } while (CycleNumber1 != CycleNumber2) ;
    
    NmVectorPtr = 0 ;
    Fr_17_Eray_GetNmVector(0, (uint8 *) &NmVectorPtr) ;
      
    FrDemo_CopyReceivedData(FrDemo_RxDataBuffer, FrDemo_RxData[j], RxLSduLength) ;

    FrDemo_NmVectorPtr [j] = NmVectorPtr ;
    
    j++ ;
    
  }while(FR_17_ERAY_DATA_COUNT - j); 
  
  print_f("Received Data [NM Vector]:");
  for(j = 0; j < FR_17_ERAY_DATA_COUNT; j++)
  {
    /* validate data part only */
    if( FrDemo_VerifyData( FrDemo_RxData[j], TxLSduLength, j, InitialData))
    {
      ErrorCount++ ;
    }
    
    if((j % 3) == 0)
    {
      print_f("\n");
    }
    
