h2s0109/smart/Mcal_file/TC23x_ABstep/Aurix_MC-ISAR/fr_17_eray_infineon_tricore/demo/src/Fr_17_Eray_Demo.c
    FrDemo_PrintData(FrDemo_RxData[j], TxLSduLength) ;
    print_f(" [%x], ", FrDemo_NmVectorPtr[j]);
  }  
  
  print_f("\n");
  
  return ErrorCount ;  
}

uint32 FrDemo_ReconfigLpduTest(
  uint16 TxLPduIdx, 
  uint8 TxLSduLength,
  uint16 RxLPduIdx,
  uint8 InitialData
)
{
  uint8 RxLSduLength ;
  Std_ReturnType RetValue ;
  uint32 ErrorCount = 0,j ;

  Fr_TxLPduStatusType TxLPduStatus ;
  Fr_RxLPduStatusType RxLPduStatus ;
  
  
 /*----------------------------------------------------------------------------*/
/*            Reconfigured Lpdus Data transmission and reception                          */
/*----------------------------------------------------------------------------*/
  print_f("Data transmission and reception in progress... \n"); 
  
  /* Initial data */
  FrDemo_InitializeBuffer(FrDemo_RxDataBuffer, TxLSduLength, InitialData);
    
   /* Create new data to be transferred */
    FrDemo_PrepareTxData(FrDemo_RxDataBuffer, FrDemo_TxDataBuffer, TxLSduLength);
    
    /* Reconfigure the Tx LPdu for Transmission */
    Fr_17_Eray_ReconfigLPdu( 0, TxLPduIdx, FR_RECONFIGURED_FRAME_ID, FR_CHANNEL_A, FR_TX_CYCLE_REP_COUNT, FR_TX_BASE_CYCLE, TxLSduLength, FR_TX_LPDU_HEADER_CRC_VAL );
    /* Reconfigure the Rx LPdu for Reception */
    Fr_17_Eray_ReconfigLPdu( 0, RxLPduIdx, FR_RECONFIGURED_FRAME_ID, FR_CHANNEL_A, FR_RX_CYCLE_REP_COUNT, FR_RX_BASE_CYCLE, TxLSduLength, 0 );
    
    RetValue = Fr_17_Eray_TransmitTxLPdu(0, TxLPduIdx, (uint8*) &FrDemo_TxDataBuffer, 
                                                        TxLSduLength) ;
    if(RetValue == E_NOT_OK)
    {
      print_f("Fr_17_Eray_TransmitTxLPdu returned E_NOT_OK\n");
      ErrorCount++ ;
      return ErrorCount ;
    }
    
    do
    {
      RetValue = Fr_17_Eray_CheckTxLPduStatus(0, TxLPduIdx, &TxLPduStatus);
      
      if(RetValue == E_NOT_OK)
      {
        print_f("Fr_17_Eray_CheckTxLPduStatus returned E_NOT_OK\n");
        ErrorCount++ ;
        return ErrorCount ;
      }    
    }while (TxLPduStatus != FR_TRANSMITTED);    
    
	  print_f("\nReconfigured Lpdu Transmitted Data Length is %d",TxLSduLength);
	  print_f("\nReconfigured Lpdu Transmitted Data []:");
	  FrDemo_PrintData(FrDemo_TxDataBuffer, TxLSduLength) ;

    /* Make sure fresh data is received */
    FrDemo_InitializeBuffer(FrDemo_RxDataBuffer, TxLSduLength, 0xDE);
    
      RetValue = Fr_17_Eray_ReceiveRxLPdu(0, RxLPduIdx, (uint8*) &FrDemo_RxDataBuffer, 
                                              &RxLPduStatus, &RxLSduLength);
                         
      if(RetValue == E_NOT_OK)
      {
        print_f("Fr_17_Eray_ReceiveRxLPdu returned E_NOT_OK\n");
        ErrorCount++ ;
        return ErrorCount ;
      }

	  print_f("\n\nReconfigured Lpdu Received Data Length is %d",RxLSduLength);
	  print_f("\nReconfigured Lpdu Received Data []:");
	  FrDemo_PrintData(FrDemo_RxDataBuffer, RxLSduLength) ;
  
    if((RxLPduStatus == FR_RECEIVED)&&(TxLPduStatus == FR_TRANSMITTED))
    {
		  print_f("\n\nSuccessfull Transmission and Reception of Data using Reconfigured Lpdus");
	    print_f("\n-------------------------------------------------------------- \n") ;
    }

    RetValue = Fr_17_Eray_TransmitTxLPdu(0, TxLPduIdx, (uint8*) &FrDemo_TxDataBuffer, 
                                                        TxLSduLength) ;
    if(RetValue == E_NOT_OK)
    {
      print_f("Fr_17_Eray_TransmitTxLPdu returned E_NOT_OK\n");
      ErrorCount++ ;
      return ErrorCount ;
    }
    
    do
    {
      RetValue = Fr_17_Eray_CheckTxLPduStatus(0, TxLPduIdx, &TxLPduStatus);
      
      if(RetValue == E_NOT_OK)
      {
        print_f("Fr_17_Eray_CheckTxLPduStatus returned E_NOT_OK\n");
        ErrorCount++ ;
        return ErrorCount ;
      }    
    }while (TxLPduStatus != FR_TRANSMITTED);    
    
	  print_f("\n\nReconfigured Lpdu Transmitted Data Length is %d",TxLSduLength);
	  print_f("\nReconfigured Lpdu Transmitted Data []:");
	  FrDemo_PrintData(FrDemo_TxDataBuffer, TxLSduLength) ;
		print_f("\n\nSuccessfull Re-Transmission of Data using Reconfigured Lpdus");
	  print_f("\n-------------------------------------------------------------- \n") ;


   RetValue = Fr_17_Eray_TransmitTxLPdu(0, TxLPduIdx, (uint8*) &FrDemo_TxDataBuffer, 
                                                        TxLSduLength) ;
    if(RetValue == E_NOT_OK)
    {
      print_f("Fr_17_Eray_TransmitTxLPdu returned E_NOT_OK\n");
      ErrorCount++ ;
      return ErrorCount ;
    }
    
    Fr_17_Eray_CheckTxLPduStatus(0, TxLPduIdx, &TxLPduStatus);
    
    if(TxLPduStatus == FR_NOT_TRANSMITTED)
    {	    
    /* Cancel Tx LPdu Transmission */
	    RetValue = Fr_17_Eray_CancelTxLPdu(0, TxLPduIdx);
	    if(RetValue == E_NOT_OK)
	    {
	      print_f("\nFr_17_Eray_CancelTxLPdu returned E_NOT_OK\n");
	      ErrorCount++ ;
	      return ErrorCount ;
	    }
	    else
	    {
	      print_f("\nTx Lpdu Transmission Cancelled Sucessfully\n");
		    print_f("\n-------------------------------------------------------------- \n") ;
	    }
    }
    
    /* Disable the Tx LPdu for Transmission */
    Fr_17_Eray_DisableLPdu( 0, TxLPduIdx );

    RetValue = Fr_17_Eray_TransmitTxLPdu(0, TxLPduIdx, (uint8*) &FrDemo_TxDataBuffer, 
                                                        TxLSduLength) ;
    if(RetValue == E_NOT_OK)
    {
      print_f("Fr_17_Eray_TransmitTxLPdu returned E_NOT_OK\n");
      ErrorCount++ ;
      return ErrorCount ;
    }
    
    Fr_17_Eray_CheckTxLPduStatus(0, TxLPduIdx, &TxLPduStatus);
    
    if(TxLPduStatus == FR_NOT_TRANSMITTED)
    {	    
       print_f("\nTx Lpdu Transmission Disabled Sucessfully \n");
	    print_f("\n-------------------------------------------------------------- \n") ;
    }

    /* Disable the Rx LPdu for Reception */
    Fr_17_Eray_DisableLPdu( 0, RxLPduIdx );
    
    /* Make sure fresh data is received */
    FrDemo_InitializeBuffer(FrDemo_RxDataBuffer, TxLSduLength, 0xDE);

    j = 0;
    do 
    {
      RetValue = Fr_17_Eray_ReceiveRxLPdu(0, RxLPduIdx, (uint8*) &FrDemo_RxDataBuffer, 
                                              &RxLPduStatus, &RxLSduLength);
      j++;                   
      if(RetValue == E_NOT_OK)
      {
        print_f("Fr_17_Eray_ReceiveRxLPdu returned E_NOT_OK\n");
        ErrorCount++ ;
        return ErrorCount ;
      }
    }while((RxLPduStatus != FR_RECEIVED)&& (j != 255));

    if((RxLPduStatus == FR_NOT_RECEIVED)&&(!RxLSduLength))
    {
      print_f("\nRx Lpdu Reception Disabled Sucessfully\n");
	    print_f("\n-------------------------------------------------------------- \n") ;
    }		    

		print_f("\n");
		return ErrorCount ;  
}


uint32 FrDemo_TimerTest(void)
{
  uint8 Fr_17_Eray_Cycle ;
  uint16 Fr_17_Eray_MacroTick ;
  uint32 ErrorCount = 0 ;
  volatile uint32 j;
  
  boolean Fr_IRQStatusPtr = FALSE ;  
  
