h2s0109/smart/Mcal_file/TC23x_ABstep/Aurix_MC-ISAR/fr_17_eray_infineon_tricore/demo/src/Fr_17_Eray_Demo.c
/*----------------------------------------------------------------------------*/
      /*  
        Test for 
              - Fr_17_Eray_SetAbsoluteTimer
              - Fr_17_Eray_EnableAbsoluteTimerIRQ
              - Fr_17_Eray_GetAbsoluteTimerIRQStatus 
              - Fr_17_Eray_AckAbsoluteTimerIRQ 
      */
/*----------------------------------------------------------------------------*/
  print_f("\n");
  print_f("\n-------------------------------------------------------------- \n") ;
  print_f("Testing APIs Fr_17_Eray_SetAbsoluteTimer, Fr_17_Eray_EnableAbsoluteTimerIRQ, \n");
  print_f("Fr_17_Eray_GetAbsoluteTimerIRQStatus, Fr_17_Eray_AckAbsoluteTimerIRQ...");
  
  /* Program absolute timer: Cycle = 5, macrotick = 2 */
  Fr_17_Eray_SetAbsoluteTimer(0, 0, 5, 2);
  
  Fr_17_Eray_EnableAbsoluteTimerIRQ(0, 0) ;
    
  /* Look for two absolute timer events ==> 2*64 communication cycles */
  j = 2;
  
  do
  {       
    Fr_IRQStatusPtr = FALSE ;
   
    do 
    {
      Fr_17_Eray_GetAbsoluteTimerIRQStatus(0, 0, &Fr_IRQStatusPtr) ;
    }while(Fr_IRQStatusPtr != TRUE);
    
    Fr_IRQStatusPtr = FALSE ;
    
    /* Acknowledge Absolute timer interrupt */
    Fr_17_Eray_AckAbsoluteTimerIRQ(0, 0);

  }while (j--) ; 
  
  print_f(" DONE.\n\n");
  
 
/*----------------------------------------------------------------------------*/
   /*  Test for Fr_17_Eray_DisableAbsoluteTimerIRQ  */
/*----------------------------------------------------------------------------*/

  /* ------------  Only absolute timer IRQ disabled ---------------- */
  print_f("Testing API Fr_17_Eray_DisableAbsoluteTimerIRQ...");
  
    
  /* Disable absolute timer request only */  
  Fr_17_Eray_DisableAbsoluteTimerIRQ(0, 0) ;
  
  /* Clear both timer interrupts */
  Fr_17_Eray_AckAbsoluteTimerIRQ(0, 0);  
  
  do 
  {
    Fr_17_Eray_GetGlobalTime(0, &Fr_17_Eray_Cycle, &Fr_17_Eray_MacroTick) ;
  }while(Fr_17_Eray_Cycle != 0);
  
  do 
  {
    Fr_17_Eray_GetGlobalTime(0, &Fr_17_Eray_Cycle, &Fr_17_Eray_MacroTick) ;
  }while(Fr_17_Eray_Cycle != 63);
  
  Fr_IRQStatusPtr = FALSE ;    
  Fr_17_Eray_GetAbsoluteTimerIRQStatus(0, 0, &Fr_IRQStatusPtr) ;

  /* Absolute timer event is NOT expected */    
  if(Fr_IRQStatusPtr == TRUE)
  {
    ErrorCount++ ;
    print_f("Error: Unexpected absolute timer event (1).\n");
  }
  

  print_f(" DONE.\n\n");
  
  /* ------------  Both timers IRQ disabled ------------------- */
        
  print_f("Testing API Fr_17_Eray_DisableAbsoluteTimerIRQ ...");
  
 
  do 
  {
    Fr_17_Eray_GetGlobalTime(0, &Fr_17_Eray_Cycle, &Fr_17_Eray_MacroTick) ;
  }while(Fr_17_Eray_Cycle != 0);
  
  do 
  {
    Fr_17_Eray_GetGlobalTime(0, &Fr_17_Eray_Cycle, &Fr_17_Eray_MacroTick) ;
  }while(Fr_17_Eray_Cycle != 63);
  
  Fr_IRQStatusPtr = FALSE ;    
  Fr_17_Eray_GetAbsoluteTimerIRQStatus(0, 0, &Fr_IRQStatusPtr) ;

  /* Absolute timer event is NOT expected */    
  if(Fr_IRQStatusPtr == TRUE)
  {
    ErrorCount++ ;
    print_f("Error: Unexpected absolute timer event (2).\n");
  }
  
 
  print_f(" DONE.\n");
  
/*----------------------------------------------------------------------------*/
      /* Test for Fr_17_Eray_CancelAbsoluteTimer */
/*----------------------------------------------------------------------------*/

  print_f("Testing API Fr_17_Eray_CancelAbsoluteTimer ...");
  
  Fr_17_Eray_EnableAbsoluteTimerIRQ(0, 0) ;
  
  do 
  {
    Fr_17_Eray_GetGlobalTime(0, &Fr_17_Eray_Cycle, &Fr_17_Eray_MacroTick) ;
  }while(Fr_17_Eray_Cycle != 0);
  
  do 
  {
    Fr_17_Eray_GetGlobalTime(0, &Fr_17_Eray_Cycle, &Fr_17_Eray_MacroTick) ;
  }while(Fr_17_Eray_Cycle != 10);

  Fr_IRQStatusPtr = FALSE ;    
  Fr_17_Eray_GetAbsoluteTimerIRQStatus(0, 0, &Fr_IRQStatusPtr) ;
    
  /* Absolute timer event is expected */
  if(Fr_IRQStatusPtr == FALSE)
  {
    ErrorCount++ ;
    print_f("Error: Expected absolute timer event didn't occur (2).\n");
  }
  
  
  /* Stop the timers */
  Fr_17_Eray_CancelAbsoluteTimer(0, 0);
 
  /* Clear the timer events */
  Fr_17_Eray_AckAbsoluteTimerIRQ(0, 0);
  
  /* ---- Wait for 64 communication cycles ----*/
  do 
  {
    Fr_17_Eray_GetGlobalTime(0, &Fr_17_Eray_Cycle, &Fr_17_Eray_MacroTick) ;
  }while(Fr_17_Eray_Cycle != 0);
  
  do 
  {
    Fr_17_Eray_GetGlobalTime(0, &Fr_17_Eray_Cycle, &Fr_17_Eray_MacroTick) ;
  }while(Fr_17_Eray_Cycle != 63);

  /* -----------------------------------------*/
    
  Fr_IRQStatusPtr = FALSE ;    
  Fr_17_Eray_GetAbsoluteTimerIRQStatus(0, 0, &Fr_IRQStatusPtr) ;

  /* Absolute timer event is NOT expected */    
  if(Fr_IRQStatusPtr == TRUE)
  {
    ErrorCount++ ;
    print_f("Error: Unexpected absolute timer event (3).\n");
  }
  
  print_f(" DONE.\n\n");
  print_f("-------------------------------------------------------------- \n") ;
  
/*----------------------------------------------------------------------------*/
  return ErrorCount ;  
}  


#ifdef FR_17_ERAY_PBCFG_0

/*******************************************************************************
** Syntax : void IrqEray_Init(void)                                               **
**                                                                            **
** Service ID:   : NA                                                         **
**                                                                            **
** Sync/Async:   : Synchronous                                                **
**                                                                            **
** Reentrancy:   : Non Reentrant                                              **
**                                                                            **
** Parameters (in): none                                                      **
**                                                                            **
** Parameters (out): none                                                     **
**                                                                            **
** Return value: none                                                         **
**                                                                            **
** Description : Function to initialize interrupt service register INT0SRC to **
**               SRE = 1 , SRPN = 100;                                        **
**               Purpose of this function is to validate interrupt            **
**               functionality, so should be used in such scenarios.        ** 
**               Note: Should be called after Fr_17_Eray_Init function        **
**                                                                            **
*******************************************************************************/
void IrqEray_Init(void)
{
  SRC_ERAY_ERAY0_INT0.B.SRE = 1;
  SRC_ERAY_ERAY0_INT0.B.SRPN = 100U;
}


