h2s0109/smart/Mcal_file/TC23x_ABstep/Aurix_MC-ISAR/fr_17_eray_infineon_tricore/demo/src/Fr_17_Eray_Demo.c
/*******************************************************************************
** Syntax :       void INTERRUPT (100) ERAY_ISR_SRN0(void)                    **
**                                                                            **
** Service ID:   : NA                                                         **
**                                                                            **
** Sync/Async:   : Asynchronous                                                **
**                                                                            **
** Reentrancy:   : Non Reentrant                                              **
**                                                                            **
** Parameters (in): none                                                      **
**                                                                            **
** Parameters (out): none                                                     **
**                                                                            **
** Return value: none                                                         **
**                                                                            **
** Description : ISR for Ablsoute timer interrupt. Reads Global time and      **
**               prints cycle number along with macrotick.                    **
**               Purpose of this function is to validate interrupt            ** 
**               functionality, so will be valid when IrqEray_Init is called. **
**                                                                            **
*******************************************************************************/
void ERAY_ISR_SRN0(void)
{
  uint8 CycleNumber;
  uint16 MacroTickPtr ;

	Fr_17_Eray_GetGlobalTime(0, &CycleNumber, &MacroTickPtr);
	print_f("CycleNumber : %d   MacroTick : %d\n",CycleNumber, MacroTickPtr ); 
	
	SRC_ERAY_ERAY0_TINT0.B.CLRR = 1; /* Clear the request bit */
}

#endif /* #ifdef(FR_17_ERAY_PBCFG_0) */
